{
  "entries": [
    {
      "type": "chapter",
      "id": "485627c2-99f0-4d67-afae-929778a9dc0b",
      "parameters": [
        "Title:1",
        "Introduction",
        "Description:1",
        "A brief introduction to build tools in general and where Gradle fits in all this."
      ]
    },
    {
      "type": "markdown",
      "id": "5ab58491-4c1d-4b40-a0c4-09851b234e31",
      "parameters": [
        "Skill requires time to grasp. If this is your first [Gradle](https://gradle.org/) experience, then don't expect to",
        "master it by just reading through. Unfortunately, there are no shortcuts, and you will only learn by doing. I am not",
        "telling you this to discourage you. On the contrary. I am telling you this so that you can set your expectations right",
        "and most importantly, don't give up.",
        "",
        "Remember that we make mistakes, we make some more, and that's how we learn.",
        ""
      ]
    },
    {
      "type": "section",
      "id": "0dc0f920-d075-46e2-8fe3-167d94d7b16d",
      "parameters": [
        "What's Gradle?"
      ]
    },
    {
      "type": "markdown",
      "id": "d7c5f0e7-6ba6-4f20-a605-a8d54c1972e6",
      "parameters": [
        "Programming is more than just typing. We need to compile our code, run tests, package the code and deploy it amongst",
        "other things. Gradle is a built tool, like [Ant](https://ant.apache.org/) and [Maven](https://maven.apache.org/) to name",
        "two, that can help to free programmer from these mundane tasks. Things that do not require thought, such as compile the",
        "code or run the test, can be automated. Gradle, like any built-tool, excels at these things and can be used instead.",
        ""
      ]
    },
    {
      "type": "section",
      "id": "0c28d9d9-f27d-48da-ae20-988f2c9954a2",
      "parameters": [
        "Given that there are different built tools, why Gradle?"
      ]
    },
    {
      "type": "markdown",
      "id": "ae83f0b6-3bc1-4994-a490-f00332b44d5a",
      "parameters": [
        "Gradle joined the party late, and learnt from its predecessors. Gradle has two key things in it favour",
        "",
        "- Uses Groovy (or Kotlin) as its configuration language. Maven uses XML, which is bloated and limited in its abilities.",
        "  We can have actual code in the configuration which makes it powerful.",
        "- Faster. [Spring Boot moved from Maven to Gradle](https://spring.io/blog/2020/06/08/migrating-spring-boot-s-build-to-gradle)",
        "  and reported considerable performance gains",
        "  > We're really pleased with how the migration went and the decrease in build times that we have seen. CI builds are",
        "  > now taking roughly 20 minutes on average, 3-4 times faster than before. Local builds are taking an average of 2",
        "  > minutes 30 seconds, which is 20-30 times faster than before.",
        ""
      ]
    }
  ]
}